
const int Value_Lockpick = 10;
const int Value_Key_01 = 3;
const int Value_Key_02 = 3;
const int Value_Key_03 = 3;

instance ItKE_lockpick(C_Item)
{
	name = "Отмычка";
	mainflag = ITEM_KAT_NONE;
	flags = ITEM_MULTI;
	value = Value_Lockpick;
	visual = "ItKe_Lockpick.3ds";
	material = MAT_METAL;
	description = name;
	text[5] = NAME_Value;
	count[5] = value;
};

/*----------------------------------------------------------------------*/
// Ключ от сундука Аластера.
/*----------------------------------------------------------------------*/
instance ITKE_Key_DS2P_ALASTER_CHEST(ITKE_Key_Proto){visual = "ItKe_Key_02.3ds";};
/*----------------------------------------------------------------------*/
// Ключ от сундука ^Никки^.
// Воруем у ^Никки^ по квесту "Да ты Ведьма!"
/*----------------------------------------------------------------------*/
instance ITKE_Key_DS2P_NIKKI_CHEST(ITKE_Key_Proto){	visual = "ItKe_Key_01.3ds";	description = "Ключ Никки";
	text[1] = "Принадлежит крестьянке Никки";
};
/*----------------------------------------------------------------------*/
// Ключ от сундука с чертежами пирата ^Джозеф^.
// Даёт ^Джозеф^ по квесту "Потерянные чертежи"
/*----------------------------------------------------------------------*/
instance ITKE_Key_DS2P_JOSEPH_CHEST(ITKE_Key_Proto){	visual = "ItKe_Key_03.3ds";	description = "Ключ от сундука с чертежами";
	text[1] = "Принадлежит пирату Джозефу";
};
/*----------------------------------------------------------------------*/
// Ключ от сундука крест-на ^Хуно^.
// Даёт крест-ка ^Мария^ по квесту "Оружие для борьбы"
/*----------------------------------------------------------------------*/
instance ITKE_Key_DS2P_HUNO_CHEST(ITKE_Key_Proto){	visual = "ItKe_Key_01.3ds";	description = "Ключ от сундука Хуно";
	text[1] = "Мне его отдала Мария";
};
/*----------------------------------------------------------------------*/
// Ключ от сундука крест-на ^Барок^.
// Даёт крест-ка ^Мария^ по квесту "Оружие для борьбы"
/*----------------------------------------------------------------------*/
instance ITKE_Key_DS2P_BAROK_CHEST(ITKE_Key_Proto){	visual = "ItKe_Key_02.3ds";	description = "Ключ от сундука Барока";
	text[1] = "Мне его отдала Мария";
};
/*------------------------------------------------------------------------*/
// Ключ от дома крест-на ^Дил^ (дурачок).
// Можно выкрасть из комнаты крест-на ^Кадар^ по квесту "Оружие для борьбы"
/*------------------------------------------------------------------------*/
instance ITKE_Key_DS2P_DIL_HOUSE(ITKE_Key_Proto){	visual = "ItKe_Key_03.3ds";	description = "Ключ от дома Дила";
	text[1] = "Лежал в доме Кадара";
};
/*------------------------------------------------------------------------*/
// Ключ «от сундука на поляне».
// Дает ^Нарев^ за выслушанную историю (без квеста).
/*------------------------------------------------------------------------*/
instance ITKE_Key_DS2P_NAREV(ITKE_Key_Proto){	visual = "ItKe_Key_03.3ds";	description = "Ключ от сундука на поляне";
	text[1] = "Его мне дал Нарев";
};
/*------------------------------------------------------------------------*/
// Ключ «от сундука в соляной пещере».
// Дает ^Гарон^ или ^Харок^ по квесту "Внук рыбака".
/*------------------------------------------------------------------------*/
instance ITKE_Key_DS2P_GARON(ITKE_Key_Proto){	visual = "ItKe_Key_03.3ds";	description = "Ключ от сундука в соляной пещере";
	text[1] = "В одной из штолен соляной пещеры";
	text[2] = "Харок и Гарон прятали свои находки и золото.";
};
/*------------------------------------------------------------------------*/
// Старый ключ
// Забирается с трупа Скелета-Лана во Сне Лана, чтобы открыть клетку. Квест "Кошмары".
/*------------------------------------------------------------------------*/
instance ITKE_Key_DS2P_LANSCAGE(ITKE_Key_Proto){	visual = "ItKe_Key_03.3ds";	description = "Старый ключ";
	text[1] = "Я забрал его с трупа";
	text[2] = "скелета во сне Лана.";
};
/*------------------------------------------------------------------------*/
// Ключ
// Крадется у Зедда по квесту "Компромат на Зедда".
/*------------------------------------------------------------------------*/
instance ITKE_Key_DS2P_ZEDDCOMPROMISE(ITKE_Key_Proto){	visual = "ItKe_Key_03.3ds";	description = "Ключ";
	text[1] = "Я украл его у Зедда.";
};
/*------------------------------------------------------------------------*/
// Ключ от сундука Ватраса на Эсмеральде.
// Дает ^Ватрас^ по квесту "Каменные таблички древних".
/*------------------------------------------------------------------------*/
instance ITKE_Key_DS2P_VATRAS_CHEST(ITKE_Key_Proto){	visual = "ItKe_Key_01.3ds";	description = "Ключ от сундука Ватраса";
	text[1] = "Сундук Ватраса с его записями о Зодчих";
	text[2] = "стоит в его каюте на Эсмеральде.";
};

/*------------------------------------------------------------------------*/
// Каменный ключ от подвала под библиотекой древних.
// Лежит в сундуке в библиотеке.
// TO DO visual
/*------------------------------------------------------------------------*/
instance ITKE_DS2P_Library_Cellar(ITKE_Key_Proto){	visual = "ItKe_Key_01.3ds";	description = "Ключ из библиотеки";
	text[1] = "Каменный ключ, который";
	text[2] = "я нашел в сундуке в библиотеке.";
};

